{
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "model_type": "gpt2",
  "vocab_size": 371,
  "n_embd": 512,
  "n_layer": 8,
  "n_head": 8,
  "n_inner": 2048,
  "n_positions": 1024,
  "activation_function": "gelu_new",
  "layer_norm_epsilon": 1e-05,
  "tie_word_embeddings": false
}